# 词类名称相关方法

# 中文词类名称转换
def chinese_word_class(string):
    chinese_word = {
        'a': '形容词', 'ad': '副形词', 'ag': '形语素', 'an': '名形词', 'b': '区别词',
        'c': '连词', 'd': '副词', 'df': '不要', 'dg': '副语素',
        'e': '叹词', 'f': '方位词', 'g': '语素', 'h': '前接成分',
        'i': '成语', 'j': '简称略语', 'k': '后接成分', 'l': '习用语',
        'm': '数词', 'mg': '数语素', 'mq': '数量词',
        'n': '名词', 'ng': '名语素', 'nr': '人名', 'nrfg': '古代人名', 'nrt': '音译人名',
        'ns': '地名', 'nt': '机构团体', 'nz': '其他专名',
        'o': '拟声词', 'p': '介词', 'q': '量词',
        'r': '代词', 'rg': '代语素', 'rr': '人称代词', 'rz': '指示代词',
        's': '处所词', 't': '时间词', 'tg': '时间语素',
        'u': '助词', 'ud': '助词“得”', 'ug': '助词“过”', 'uj': '助词“的”', 'ul': '助词“了”', 'uv': '助词“地”', 'uz': '助词“着”',
        'v': '动词', 'vd': '副动词', 'vg': '动语素', 'vi': '不及物动词', 'vn': '名动词', 'vq': '趋向动词',
        'x': '非语素字', 'y': '语气词', 'z': '状态词', 'zg': '状态语素', 'eng': '英语单词'
    }
    try:
        chinese_result = chinese_word[string]
    except KeyError:
        if string == "":
            chinese_result = ""
        else:
            chinese_result = f"未知词性（{string}）"
    return chinese_result

# 简写词类名称转换
def simple_word_class(string):
    simple_word = {
        '形容词': 'a', '副形词': 'ad', '形语素': 'ag', '名形词': 'an', '区别词': 'b',
        '连词': 'c', '副词': 'd', '不要': 'df', '副语素': 'dg',
        '叹词': 'e', '方位词': 'f', '语素': 'g', '前接成分': 'h',
        '成语': 'i', '简称略语': 'j', '后接成分': 'k', '习用语': 'l',
        '数词': 'm', '数语素': 'mg', '数量词': 'mq',
        '名词': 'n', '名语素': 'ng', '人名': 'nr', '古代人名': 'nrfg', '音译人名': 'nrt',
        '地名': 'ns', '机构团体': 'nt', '其他专名': 'nz',
        '拟声词': 'o', '介词': 'p', '量词': 'q',
        '代词': 'r', '代语素': 'rg', '人称代词': 'rr', '指示代词': 'rz',
        '处所词': 's', '时间词': 't', '时间语素': 'tg',
        '助词': 'u', '助词“得”': 'ud', '助词“过”': 'ug', '助词“的”': 'uj', '助词“了”': 'ul', '助词“地”': 'uv', '助词“着”': 'uz',
        '动词': 'v', '副动词': 'vd', '动语素': 'vg', '不及物动词': 'vi', '名动词': 'vn', '趋向动词': 'vq',
        '非语素字': 'x', '语气词': 'y', '状态词': 'z', '状态语素': 'zg', '英语单词': 'eng'
    }
    try:
        simple_result = simple_word[string]
    except KeyError:
        simple_result = string
    return simple_result